#+Title: Insertion Sort

* About 
  This sorting algorithm sorts a list in place. The basic idea
  is that if we have a list of elements we can sort that list
  by considering one element of the list at a time and comparing it 
  to all the elements before it. If our element is
  less than any of the elements before it then we move it before them
  in the list. We keep doing this process until we reach the end of our
  list.
  

* Implementation
  Here is my implementation of of the insertion sort
  #+BEGIN_SRC python :session insertion-sort :results silent
    # sorts the array a in ascending order
    def insertSort(a):
        # i is the position in the array of the element to be sorted 
        for i in range(1,len(a)):
            # remove the current element out of the list
            current = a[i]
            # k is the position of the last removed element
            k = i
            # j is position before the last remove element 
            j = k - 1
            # stop looping once the last empty element is the first element of the array (k = 0)
            # or the previous element is no longer greater
            while k != 0 and a[j] > current:
                # if the element at j is greater than the current element
                # we remove it from it's spot and put it in the spot of the last removed
                # element
                a[k] = a[j]
                # update k
                k = j 
                j = k - 1
            # finally, move the current element to the last empty position, k
            a[k] = current
    #+END_SRC


* Verifying it
  #+BEGIN_SRC python :session insertion-sort :exports both
    a = [100, -89, 10000, 0, 2, 100]
    output = "Before sort " + str(a)
    insertSort(a)
    output += "\nAfter sort " + str(a)

    output
  #+END_SRC

  #+RESULTS:
  : Before sort [100, -89, 10000, 0, 2, 100]
  : After sort [-89, 0, 2, 100, 100, 10000]

  #+BEGIN_SRC python :session insertion-sort :results org 
    a = [100, -89, 10000, 0, 2, 100]
    output = "Before sort " + str(a)
    insertSort(a)
    output += "\nAfter sort " + str(a)

    output
  #+END_SRC

  #+RESULTS:
  #+BEGIN_SRC org
  Before sort [100, -89, 10000, 0, 2, 100]
  After sort [-89, 0, 2, 100, 100, 10000]
  #+END_SRC





  
  
  
  
  
